GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32h75ey(m)xx-pinctrl.h
/* CK_OUT0 */
#define CK_OUT0_PA8 \
	GD32_PINMUX_AF('A', 8, AF0)

/* CK_OUT1 */
#define CK_OUT1_PC9 \
	GD32_PINMUX_AF('C', 9, AF0)

/* CMP0_IM6 */
#define CMP0_IM6_PB1 \
	GD32_PINMUX_AF('B', 1, ANALOG)

/* CMP0_IM7 */
#define CMP0_IM7_PC4 \
	GD32_PINMUX_AF('C', 4, ANALOG)

/* CMP0_IP0 */
#define CMP0_IP0_PB0 \
	GD32_PINMUX_AF('B', 0, ANALOG)

/* CMP0_IP1 */
#define CMP0_IP1_PB2 \
	GD32_PINMUX_AF('B', 2, ANALOG)

/* CMP0_OUT */
#define CMP0_OUT_PC5 \
	GD32_PINMUX_AF('C', 5, AF13)
#define CMP0_OUT_PE12 \
	GD32_PINMUX_AF('E', 12, AF13)

/* CMP1_IM6 */
#define CMP1_IM6_PE10 \
	GD32_PINMUX_AF('E', 10, ANALOG)

/* CMP1_IM7 */
#define CMP1_IM7_PE7 \
	GD32_PINMUX_AF('E', 7, ANALOG)

/* CMP1_IP0 */
#define CMP1_IP0_PE9 \
	GD32_PINMUX_AF('E', 9, ANALOG)

/* CMP1_IP1 */
#define CMP1_IP1_PE11 \
	GD32_PINMUX_AF('E', 11, ANALOG)

/* CMP1_OUT */
#define CMP1_OUT_PE8 \
	GD32_PINMUX_AF('E', 8, AF13)
#define CMP1_OUT_PE13 \
	GD32_PINMUX_AF('E', 13, AF13)

/* CMP_MUX_OUT0 */
#define CMP_MUX_OUT0_PA6 \
	GD32_PINMUX_AF('A', 6, AF10)

/* CMP_MUX_OUT1 */
#define CMP_MUX_OUT1_PA8 \
	GD32_PINMUX_AF('A', 8, AF12)

/* CMP_MUX_OUT2 */
#define CMP_MUX_OUT2_PB12 \
	GD32_PINMUX_AF('B', 12, AF13)

/* CMP_MUX_OUT3 */
#define CMP_MUX_OUT3_PE6 \
	GD32_PINMUX_AF('E', 6, AF11)

/* CMP_MUX_OUT4 */
#define CMP_MUX_OUT4_PE15 \
	GD32_PINMUX_AF('E', 15, AF13)

/* CTC_SYNC */
#define CTC_SYNC_PB3 \
	GD32_PINMUX_AF('B', 3, AF10)

/* DAC0_OUT0 */
#define DAC0_OUT0_PA4 \
	GD32_PINMUX_AF('A', 4, ANALOG)

/* DAC0_OUT1 */
#define DAC0_OUT1_PA5 \
	GD32_PINMUX_AF('A', 5, ANALOG)

/* EDOUT_A */
#define EDOUT_A_PD12 \
	GD32_PINMUX_AF('D', 12, AF6)
#define EDOUT_A_PH7 \
	GD32_PINMUX_AF('H', 7, AF3)

/* EDOUT_B */
#define EDOUT_B_PD13 \
	GD32_PINMUX_AF('D', 13, AF6)
#define EDOUT_B_PH8 \
	GD32_PINMUX_AF('H', 8, AF3)

/* EDOUT_Z */
#define EDOUT_Z_PD14 \
	GD32_PINMUX_AF('D', 14, AF6)
#define EDOUT_Z_PH9 \
	GD32_PINMUX_AF('H', 9, AF3)

/* EVENTOUT */
#define EVENTOUT_PA0 \
	GD32_PINMUX_AF('A', 0, AF15)
#define EVENTOUT_PA1 \
	GD32_PINMUX_AF('A', 1, AF15)
#define EVENTOUT_PA2 \
	GD32_PINMUX_AF('A', 2, AF15)
#define EVENTOUT_PA3 \
	GD32_PINMUX_AF('A', 3, AF15)
#define EVENTOUT_PA4 \
	GD32_PINMUX_AF('A', 4, AF15)
#define EVENTOUT_PA5 \
	GD32_PINMUX_AF('A', 5, AF15)
#define EVENTOUT_PA6 \
	GD32_PINMUX_AF('A', 6, AF15)
#define EVENTOUT_PA7 \
	GD32_PINMUX_AF('A', 7, AF15)
#define EVENTOUT_PA8 \
	GD32_PINMUX_AF('A', 8, AF15)
#define EVENTOUT_PA9 \
	GD32_PINMUX_AF('A', 9, AF15)
#define EVENTOUT_PA10 \
	GD32_PINMUX_AF('A', 10, AF15)
#define EVENTOUT_PA11 \
	GD32_PINMUX_AF('A', 11, AF15)
#define EVENTOUT_PA12 \
	GD32_PINMUX_AF('A', 12, AF15)
#define EVENTOUT_PA13 \
	GD32_PINMUX_AF('A', 13, AF15)
#define EVENTOUT_PA14 \
	GD32_PINMUX_AF('A', 14, AF15)
#define EVENTOUT_PA15 \
	GD32_PINMUX_AF('A', 15, AF15)
#define EVENTOUT_PB0 \
	GD32_PINMUX_AF('B', 0, AF15)
#define EVENTOUT_PB1 \
	GD32_PINMUX_AF('B', 1, AF15)
#define EVENTOUT_PB2 \
	GD32_PINMUX_AF('B', 2, AF15)
#define EVENTOUT_PB3 \
	GD32_PINMUX_AF('B', 3, AF15)
#define EVENTOUT_PB4 \
	GD32_PINMUX_AF('B', 4, AF15)
#define EVENTOUT_PB5 \
	GD32_PINMUX_AF('B', 5, AF15)
#define EVENTOUT_PB6 \
	GD32_PINMUX_AF('B', 6, AF15)
#define EVENTOUT_PB7 \
	GD32_PINMUX_AF('B', 7, AF15)
#define EVENTOUT_PB8 \
	GD32_PINMUX_AF('B', 8, AF15)
#define EVENTOUT_PB9 \
	GD32_PINMUX_AF('B', 9, AF15)
#define EVENTOUT_PB10 \
	GD32_PINMUX_AF('B', 10, AF15)
#define EVENTOUT_PB11 \
	GD32_PINMUX_AF('B', 11, AF15)
#define EVENTOUT_PB12 \
	GD32_PINMUX_AF('B', 12, AF15)
#define EVENTOUT_PB13 \
	GD32_PINMUX_AF('B', 13, AF15)
#define EVENTOUT_PB14 \
	GD32_PINMUX_AF('B', 14, AF15)
#define EVENTOUT_PB15 \
	GD32_PINMUX_AF('B', 15, AF15)
#define EVENTOUT_PC0 \
	GD32_PINMUX_AF('C', 0, AF15)
#define EVENTOUT_PC1 \
	GD32_PINMUX_AF('C', 1, AF15)
#define EVENTOUT_PC2 \
	GD32_PINMUX_AF('C', 2, AF15)
#define EVENTOUT_PC3 \
	GD32_PINMUX_AF('C', 3, AF15)
#define EVENTOUT_PC4 \
	GD32_PINMUX_AF('C', 4, AF15)
#define EVENTOUT_PC5 \
	GD32_PINMUX_AF('C', 5, AF15)
#define EVENTOUT_PC6 \
	GD32_PINMUX_AF('C', 6, AF15)
#define EVENTOUT_PC7 \
	GD32_PINMUX_AF('C', 7, AF15)
#define EVENTOUT_PC8 \
	GD32_PINMUX_AF('C', 8, AF15)
#define EVENTOUT_PC9 \
	GD32_PINMUX_AF('C', 9, AF15)
#define EVENTOUT_PC10 \
	GD32_PINMUX_AF('C', 10, AF15)
#define EVENTOUT_PC11 \
	GD32_PINMUX_AF('C', 11, AF15)
#define EVENTOUT_PC12 \
	GD32_PINMUX_AF('C', 12, AF15)
#define EVENTOUT_PC13 \
	GD32_PINMUX_AF('C', 13, AF15)
#define EVENTOUT_PC14 \
	GD32_PINMUX_AF('C', 14, AF15)
#define EVENTOUT_PC15 \
	GD32_PINMUX_AF('C', 15, AF15)
#define EVENTOUT_PD0 \
	GD32_PINMUX_AF('D', 0, AF15)
#define EVENTOUT_PD1 \
	GD32_PINMUX_AF('D', 1, AF15)
#define EVENTOUT_PD2 \
	GD32_PINMUX_AF('D', 2, AF15)
#define EVENTOUT_PD3 \
	GD32_PINMUX_AF('D', 3, AF15)
#define EVENTOUT_PD4 \
	GD32_PINMUX_AF('D', 4, AF15)
#define EVENTOUT_PD5 \
	GD32_PINMUX_AF('D', 5, AF15)
#define EVENTOUT_PD6 \
	GD32_PINMUX_AF('D', 6, AF15)
#define EVENTOUT_PD7 \
	GD32_PINMUX_AF('D', 7, AF15)
#define EVENTOUT_PD8 \
	GD32_PINMUX_AF('D', 8, AF15)
#define EVENTOUT_PD9 \
	GD32_PINMUX_AF('D', 9, AF15)
#define EVENTOUT_PD10 \
	GD32_PINMUX_AF('D', 10, AF15)
#define EVENTOUT_PD11 \
	GD32_PINMUX_AF('D', 11, AF15)
#define EVENTOUT_PD12 \
	GD32_PINMUX_AF('D', 12, AF15)
#define EVENTOUT_PD13 \
	GD32_PINMUX_AF('D', 13, AF15)
#define EVENTOUT_PD14 \
	GD32_PINMUX_AF('D', 14, AF15)
#define EVENTOUT_PD15 \
	GD32_PINMUX_AF('D', 15, AF15)
#define EVENTOUT_PE0 \
	GD32_PINMUX_AF('E', 0, AF15)
#define EVENTOUT_PE1 \
	GD32_PINMUX_AF('E', 1, AF15)
#define EVENTOUT_PE2 \
	GD32_PINMUX_AF('E', 2, AF15)
#define EVENTOUT_PE3 \
	GD32_PINMUX_AF('E', 3, AF15)
#define EVENTOUT_PE4 \
	GD32_PINMUX_AF('E', 4, AF15)
#define EVENTOUT_PE5 \
	GD32_PINMUX_AF('E', 5, AF15)
#define EVENTOUT_PE6 \
	GD32_PINMUX_AF('E', 6, AF15)
#define EVENTOUT_PE7 \
	GD32_PINMUX_AF('E', 7, AF15)
#define EVENTOUT_PE8 \
	GD32_PINMUX_AF('E', 8, AF15)
#define EVENTOUT_PE9 \
	GD32_PINMUX_AF('E', 9, AF15)
#define EVENTOUT_PE10 \
	GD32_PINMUX_AF('E', 10, AF15)
#define EVENTOUT_PE11 \
	GD32_PINMUX_AF('E', 11, AF15)
#define EVENTOUT_PE12 \
	GD32_PINMUX_AF('E', 12, AF15)
#define EVENTOUT_PE13 \
	GD32_PINMUX_AF('E', 13, AF15)
#define EVENTOUT_PE14 \
	GD32_PINMUX_AF('E', 14, AF15)
#define EVENTOUT_PE15 \
	GD32_PINMUX_AF('E', 15, AF15)
#define EVENTOUT_PF5 \
	GD32_PINMUX_AF('F', 5, AF15)
#define EVENTOUT_PF6 \
	GD32_PINMUX_AF('F', 6, AF15)
#define EVENTOUT_PF7 \
	GD32_PINMUX_AF('F', 7, AF15)
#define EVENTOUT_PF8 \
	GD32_PINMUX_AF('F', 8, AF15)
#define EVENTOUT_PF9 \
	GD32_PINMUX_AF('F', 9, AF15)
#define EVENTOUT_PF10 \
	GD32_PINMUX_AF('F', 10, AF15)
#define EVENTOUT_PF11 \
	GD32_PINMUX_AF('F', 11, AF15)
#define EVENTOUT_PF12 \
	GD32_PINMUX_AF('F', 12, AF15)
#define EVENTOUT_PF13 \
	GD32_PINMUX_AF('F', 13, AF15)
#define EVENTOUT_PF14 \
	GD32_PINMUX_AF('F', 14, AF15)
#define EVENTOUT_PF15 \
	GD32_PINMUX_AF('F', 15, AF15)
#define EVENTOUT_PG6 \
	GD32_PINMUX_AF('G', 6, AF15)
#define EVENTOUT_PG7 \
	GD32_PINMUX_AF('G', 7, AF15)
#define EVENTOUT_PG8 \
	GD32_PINMUX_AF('G', 8, AF15)
#define EVENTOUT_PG9 \
	GD32_PINMUX_AF('G', 9, AF15)
#define EVENTOUT_PG13 \
	GD32_PINMUX_AF('G', 13, AF15)
#define EVENTOUT_PG14 \
	GD32_PINMUX_AF('G', 14, AF15)
#define EVENTOUT_PG15 \
	GD32_PINMUX_AF('G', 15, AF15)
#define EVENTOUT_PH0 \
	GD32_PINMUX_AF('H', 0, AF15)
#define EVENTOUT_PH1 \
	GD32_PINMUX_AF('H', 1, AF15)
#define EVENTOUT_PH2 \
	GD32_PINMUX_AF('H', 2, AF15)
#define EVENTOUT_PH3 \
	GD32_PINMUX_AF('H', 3, AF15)
#define EVENTOUT_PH4 \
	GD32_PINMUX_AF('H', 4, AF15)
#define EVENTOUT_PH5 \
	GD32_PINMUX_AF('H', 5, AF15)
#define EVENTOUT_PH6 \
	GD32_PINMUX_AF('H', 6, AF15)
#define EVENTOUT_PH7 \
	GD32_PINMUX_AF('H', 7, AF15)
#define EVENTOUT_PH8 \
	GD32_PINMUX_AF('H', 8, AF15)
#define EVENTOUT_PH9 \
	GD32_PINMUX_AF('H', 9, AF15)
#define EVENTOUT_PH10 \
	GD32_PINMUX_AF('H', 10, AF15)
#define EVENTOUT_PH11 \
	GD32_PINMUX_AF('H', 11, AF15)
#define EVENTOUT_PH12 \
	GD32_PINMUX_AF('H', 12, AF15)
#define EVENTOUT_PH13 \
	GD32_PINMUX_AF('H', 13, AF15)

