GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32h75ey(m)xx-pinctrl.h
/* HPDF_CKIN0 */
#define HPDF_CKIN0_PC0 \
	GD32_PINMUX_AF('C', 0, AF3)

/* HPDF_CKIN1 */
#define HPDF_CKIN1_PB2 \
	GD32_PINMUX_AF('B', 2, AF4)
#define HPDF_CKIN1_PB13 \
	GD32_PINMUX_AF('B', 13, AF6)
#define HPDF_CKIN1_PC2 \
	GD32_PINMUX_AF('C', 2, AF3)
#define HPDF_CKIN1_PD7 \
	GD32_PINMUX_AF('D', 7, AF6)

/* HPDF_CKIN2 */
#define HPDF_CKIN2_PB15 \
	GD32_PINMUX_AF('B', 15, AF6)
#define HPDF_CKIN2_PC4 \
	GD32_PINMUX_AF('C', 4, AF3)
#define HPDF_CKIN2_PE8 \
	GD32_PINMUX_AF('E', 8, AF3)
#define HPDF_CKIN2_PF5 \
	GD32_PINMUX_AF('F', 5, AF6)

/* HPDF_CKIN3 */
#define HPDF_CKIN3_PC6 \
	GD32_PINMUX_AF('C', 6, AF4)
#define HPDF_CKIN3_PD8 \
	GD32_PINMUX_AF('D', 8, AF3)
#define HPDF_CKIN3_PE5 \
	GD32_PINMUX_AF('E', 5, AF3)

/* HPDF_CKIN4 */
#define HPDF_CKIN4_PC1 \
	GD32_PINMUX_AF('C', 1, AF4)
#define HPDF_CKIN4_PD6 \
	GD32_PINMUX_AF('D', 6, AF3)
#define HPDF_CKIN4_PE11 \
	GD32_PINMUX_AF('E', 11, AF3)

/* HPDF_CKIN5 */
#define HPDF_CKIN5_PB7 \
	GD32_PINMUX_AF('B', 7, AF11)
#define HPDF_CKIN5_PC10 \
	GD32_PINMUX_AF('C', 10, AF3)
#define HPDF_CKIN5_PE13 \
	GD32_PINMUX_AF('E', 13, AF3)

/* HPDF_CKIN6 */
#define HPDF_CKIN6_PD0 \
	GD32_PINMUX_AF('D', 0, AF3)
#define HPDF_CKIN6_PF14 \
	GD32_PINMUX_AF('F', 14, AF3)

/* HPDF_CKIN7 */
#define HPDF_CKIN7_PB8 \
	GD32_PINMUX_AF('B', 8, AF3)
#define HPDF_CKIN7_PB11 \
	GD32_PINMUX_AF('B', 11, AF6)

/* HPDF_CKOUT */
#define HPDF_CKOUT_PB0 \
	GD32_PINMUX_AF('B', 0, AF6)
#define HPDF_CKOUT_PC2 \
	GD32_PINMUX_AF('C', 2, AF6)
#define HPDF_CKOUT_PD3 \
	GD32_PINMUX_AF('D', 3, AF3)
#define HPDF_CKOUT_PD10 \
	GD32_PINMUX_AF('D', 10, AF3)
#define HPDF_CKOUT_PE9 \
	GD32_PINMUX_AF('E', 9, AF3)

/* HPDF_DATAIN0 */
#define HPDF_DATAIN0_PC1 \
	GD32_PINMUX_AF('C', 1, AF3)

/* HPDF_DATAIN1 */
#define HPDF_DATAIN1_PB1 \
	GD32_PINMUX_AF('B', 1, AF6)
#define HPDF_DATAIN1_PB12 \
	GD32_PINMUX_AF('B', 12, AF6)
#define HPDF_DATAIN1_PC3 \
	GD32_PINMUX_AF('C', 3, AF3)
#define HPDF_DATAIN1_PD6 \
	GD32_PINMUX_AF('D', 6, AF4)

/* HPDF_DATAIN2 */
#define HPDF_DATAIN2_PB14 \
	GD32_PINMUX_AF('B', 14, AF6)
#define HPDF_DATAIN2_PC5 \
	GD32_PINMUX_AF('C', 5, AF3)
#define HPDF_DATAIN2_PE7 \
	GD32_PINMUX_AF('E', 7, AF3)

/* HPDF_DATAIN3 */
#define HPDF_DATAIN3_PC7 \
	GD32_PINMUX_AF('C', 7, AF4)
#define HPDF_DATAIN3_PD9 \
	GD32_PINMUX_AF('D', 9, AF3)
#define HPDF_DATAIN3_PE4 \
	GD32_PINMUX_AF('E', 4, AF3)

/* HPDF_DATAIN4 */
#define HPDF_DATAIN4_PC0 \
	GD32_PINMUX_AF('C', 0, AF6)
#define HPDF_DATAIN4_PD7 \
	GD32_PINMUX_AF('D', 7, AF3)
#define HPDF_DATAIN4_PE10 \
	GD32_PINMUX_AF('E', 10, AF3)

/* HPDF_DATAIN5 */
#define HPDF_DATAIN5_PB6 \
	GD32_PINMUX_AF('B', 6, AF11)
#define HPDF_DATAIN5_PC11 \
	GD32_PINMUX_AF('C', 11, AF3)
#define HPDF_DATAIN5_PE12 \
	GD32_PINMUX_AF('E', 12, AF3)

/* HPDF_DATAIN6 */
#define HPDF_DATAIN6_PD1 \
	GD32_PINMUX_AF('D', 1, AF3)
#define HPDF_DATAIN6_PF13 \
	GD32_PINMUX_AF('F', 13, AF3)

/* HPDF_DATAIN7 */
#define HPDF_DATAIN7_PB9 \
	GD32_PINMUX_AF('B', 9, AF3)
#define HPDF_DATAIN7_PB10 \
	GD32_PINMUX_AF('B', 10, AF6)

/* I2C0_SCL */
#define I2C0_SCL_PB6 \
	GD32_PINMUX_AF('B', 6, AF4)
#define I2C0_SCL_PB8 \
	GD32_PINMUX_AF('B', 8, AF4)

/* I2C0_SDA */
#define I2C0_SDA_PB7 \
	GD32_PINMUX_AF('B', 7, AF4)
#define I2C0_SDA_PB9 \
	GD32_PINMUX_AF('B', 9, AF4)

/* I2C0_SMBA */
#define I2C0_SMBA_PB5 \
	GD32_PINMUX_AF('B', 5, AF4)

/* I2C1_SCL */
#define I2C1_SCL_PB10 \
	GD32_PINMUX_AF('B', 10, AF4)
#define I2C1_SCL_PH4 \
	GD32_PINMUX_AF('H', 4, AF4)

/* I2C1_SDA */
#define I2C1_SDA_PB11 \
	GD32_PINMUX_AF('B', 11, AF4)
#define I2C1_SDA_PH5 \
	GD32_PINMUX_AF('H', 5, AF4)

/* I2C1_SMBA */
#define I2C1_SMBA_PB12 \
	GD32_PINMUX_AF('B', 12, AF4)
#define I2C1_SMBA_PH6 \
	GD32_PINMUX_AF('H', 6, AF4)

/* I2C2_SCL */
#define I2C2_SCL_PA8 \
	GD32_PINMUX_AF('A', 8, AF4)
#define I2C2_SCL_PH7 \
	GD32_PINMUX_AF('H', 7, AF4)

/* I2C2_SDA */
#define I2C2_SDA_PC9 \
	GD32_PINMUX_AF('C', 9, AF4)
#define I2C2_SDA_PH8 \
	GD32_PINMUX_AF('H', 8, AF4)

/* I2C2_SMBA */
#define I2C2_SMBA_PA9 \
	GD32_PINMUX_AF('A', 9, AF4)
#define I2C2_SMBA_PH9 \
	GD32_PINMUX_AF('H', 9, AF4)

/* I2C3_SCL */
#define I2C3_SCL_PB6 \
	GD32_PINMUX_AF('B', 6, AF6)
#define I2C3_SCL_PB8 \
	GD32_PINMUX_AF('B', 8, AF6)
#define I2C3_SCL_PD12 \
	GD32_PINMUX_AF('D', 12, AF4)
#define I2C3_SCL_PF14 \
	GD32_PINMUX_AF('F', 14, AF4)
#define I2C3_SCL_PH11 \
	GD32_PINMUX_AF('H', 11, AF4)

/* I2C3_SDA */
#define I2C3_SDA_PB7 \
	GD32_PINMUX_AF('B', 7, AF6)
#define I2C3_SDA_PB9 \
	GD32_PINMUX_AF('B', 9, AF6)
#define I2C3_SDA_PD13 \
	GD32_PINMUX_AF('D', 13, AF4)
#define I2C3_SDA_PF15 \
	GD32_PINMUX_AF('F', 15, AF4)
#define I2C3_SDA_PH12 \
	GD32_PINMUX_AF('H', 12, AF4)

/* I2C3_SMBA */
#define I2C3_SMBA_PB5 \
	GD32_PINMUX_AF('B', 5, AF6)
#define I2C3_SMBA_PB9 \
	GD32_PINMUX_AF('B', 9, AF11)
#define I2C3_SMBA_PD11 \
	GD32_PINMUX_AF('D', 11, AF4)
#define I2C3_SMBA_PF13 \
	GD32_PINMUX_AF('F', 13, AF4)
#define I2C3_SMBA_PH10 \
	GD32_PINMUX_AF('H', 10, AF4)

/* I2S0_CK */
#define I2S0_CK_PA5 \
	GD32_PINMUX_AF('A', 5, AF5)
#define I2S0_CK_PB3 \
	GD32_PINMUX_AF('B', 3, AF5)

/* I2S0_MCK */
#define I2S0_MCK_PC4 \
	GD32_PINMUX_AF('C', 4, AF5)

/* I2S0_SD */
#define I2S0_SD_PA7 \
	GD32_PINMUX_AF('A', 7, AF5)
#define I2S0_SD_PB5 \
	GD32_PINMUX_AF('B', 5, AF5)
#define I2S0_SD_PD7 \
	GD32_PINMUX_AF('D', 7, AF5)

/* I2S0_WS */
#define I2S0_WS_PA4 \
	GD32_PINMUX_AF('A', 4, AF5)
#define I2S0_WS_PA15 \
	GD32_PINMUX_AF('A', 15, AF5)

/* I2S1_CK */
#define I2S1_CK_PA9 \
	GD32_PINMUX_AF('A', 9, AF5)
#define I2S1_CK_PA12 \
	GD32_PINMUX_AF('A', 12, AF5)
#define I2S1_CK_PA14 \
	GD32_PINMUX_AF('A', 14, AF5)
#define I2S1_CK_PB10 \
	GD32_PINMUX_AF('B', 10, AF5)
#define I2S1_CK_PB13 \
	GD32_PINMUX_AF('B', 13, AF5)
#define I2S1_CK_PD3 \
	GD32_PINMUX_AF('D', 3, AF5)

/* I2S1_MCK */
#define I2S1_MCK_PC6 \
	GD32_PINMUX_AF('C', 6, AF5)

/* I2S1_SD */
#define I2S1_SD_PB15 \
	GD32_PINMUX_AF('B', 15, AF5)
#define I2S1_SD_PC1 \
	GD32_PINMUX_AF('C', 1, AF5)
#define I2S1_SD_PC3 \
	GD32_PINMUX_AF('C', 3, AF5)

/* I2S1_WS */
#define I2S1_WS_PA11 \
	GD32_PINMUX_AF('A', 11, AF5)
#define I2S1_WS_PA13 \
	GD32_PINMUX_AF('A', 13, AF5)
#define I2S1_WS_PB4 \
	GD32_PINMUX_AF('B', 4, AF7)
#define I2S1_WS_PB9 \
	GD32_PINMUX_AF('B', 9, AF5)
#define I2S1_WS_PB12 \
	GD32_PINMUX_AF('B', 12, AF5)

/* I2S2_CK */
#define I2S2_CK_PB3 \
	GD32_PINMUX_AF('B', 3, AF6)
#define I2S2_CK_PC10 \
	GD32_PINMUX_AF('C', 10, AF6)

/* I2S2_MCK */
#define I2S2_MCK_PC7 \
	GD32_PINMUX_AF('C', 7, AF6)

/* I2S2_SD */
#define I2S2_SD_PB2 \
	GD32_PINMUX_AF('B', 2, AF7)
#define I2S2_SD_PB5 \
	GD32_PINMUX_AF('B', 5, AF7)
#define I2S2_SD_PC12 \
	GD32_PINMUX_AF('C', 12, AF6)
#define I2S2_SD_PD6 \
	GD32_PINMUX_AF('D', 6, AF5)

