GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32h75ey(m)xx-pinctrl.h
/* I2S2_WS */
#define I2S2_WS_PA4 \
	GD32_PINMUX_AF('A', 4, AF6)
#define I2S2_WS_PA15 \
	GD32_PINMUX_AF('A', 15, AF6)

/* I2S5_CK */
#define I2S5_CK_PA5 \
	GD32_PINMUX_AF('A', 5, AF8)
#define I2S5_CK_PB3 \
	GD32_PINMUX_AF('B', 3, AF8)
#define I2S5_CK_PC12 \
	GD32_PINMUX_AF('C', 12, AF5)
#define I2S5_CK_PG13 \
	GD32_PINMUX_AF('G', 13, AF5)

/* I2S5_MCK */
#define I2S5_MCK_PA3 \
	GD32_PINMUX_AF('A', 3, AF5)

/* I2S5_SD */
#define I2S5_SD_PA7 \
	GD32_PINMUX_AF('A', 7, AF8)
#define I2S5_SD_PB5 \
	GD32_PINMUX_AF('B', 5, AF8)
#define I2S5_SD_PG14 \
	GD32_PINMUX_AF('G', 14, AF5)

/* I2S5_WS */
#define I2S5_WS_PA0 \
	GD32_PINMUX_AF('A', 0, AF5)
#define I2S5_WS_PA4 \
	GD32_PINMUX_AF('A', 4, AF8)
#define I2S5_WS_PA15 \
	GD32_PINMUX_AF('A', 15, AF7)
#define I2S5_WS_PG8 \
	GD32_PINMUX_AF('G', 8, AF5)

/* I2S_CKIN */
#define I2S_CKIN_PC9 \
	GD32_PINMUX_AF('C', 9, AF5)

/* JTCK */
#define JTCK_PA14 \
	GD32_PINMUX_AF('A', 14, AF0)

/* JTDI */
#define JTDI_PA15 \
	GD32_PINMUX_AF('A', 15, AF0)

/* JTDO */
#define JTDO_PB3 \
	GD32_PINMUX_AF('B', 3, AF0)

/* JTMS */
#define JTMS_PA13 \
	GD32_PINMUX_AF('A', 13, AF0)

/* NJTRST */
#define NJTRST_PB4 \
	GD32_PINMUX_AF('B', 4, AF0)

/* OSPIM_P0_CSN */
#define OSPIM_P0_CSN_PB6 \
	GD32_PINMUX_AF('B', 6, AF10)
#define OSPIM_P0_CSN_PB10 \
	GD32_PINMUX_AF('B', 10, AF9)
#define OSPIM_P0_CSN_PC11 \
	GD32_PINMUX_AF('C', 11, AF9)
#define OSPIM_P0_CSN_PE11 \
	GD32_PINMUX_AF('E', 11, AF11)
#define OSPIM_P0_CSN_PG6 \
	GD32_PINMUX_AF('G', 6, AF10)

/* OSPIM_P0_IO0 */
#define OSPIM_P0_IO0_PA2 \
	GD32_PINMUX_AF('A', 2, AF6)
#define OSPIM_P0_IO0_PB1 \
	GD32_PINMUX_AF('B', 1, AF4)
#define OSPIM_P0_IO0_PB12 \
	GD32_PINMUX_AF('B', 12, AF12)
#define OSPIM_P0_IO0_PC3 \
	GD32_PINMUX_AF('C', 3, AF9)
#define OSPIM_P0_IO0_PC9 \
	GD32_PINMUX_AF('C', 9, AF9)
#define OSPIM_P0_IO0_PD11 \
	GD32_PINMUX_AF('D', 11, AF9)
#define OSPIM_P0_IO0_PF8 \
	GD32_PINMUX_AF('F', 8, AF10)

/* OSPIM_P0_IO1 */
#define OSPIM_P0_IO1_PB0 \
	GD32_PINMUX_AF('B', 0, AF4)
#define OSPIM_P0_IO1_PC10 \
	GD32_PINMUX_AF('C', 10, AF9)
#define OSPIM_P0_IO1_PD12 \
	GD32_PINMUX_AF('D', 12, AF9)
#define OSPIM_P0_IO1_PF9 \
	GD32_PINMUX_AF('F', 9, AF10)

/* OSPIM_P0_IO2 */
#define OSPIM_P0_IO2_PA3 \
	GD32_PINMUX_AF('A', 3, AF6)
#define OSPIM_P0_IO2_PA7 \
	GD32_PINMUX_AF('A', 7, AF10)
#define OSPIM_P0_IO2_PB13 \
	GD32_PINMUX_AF('B', 13, AF4)
#define OSPIM_P0_IO2_PC2 \
	GD32_PINMUX_AF('C', 2, AF9)
#define OSPIM_P0_IO2_PE2 \
	GD32_PINMUX_AF('E', 2, AF9)
#define OSPIM_P0_IO2_PF7 \
	GD32_PINMUX_AF('F', 7, AF10)

/* OSPIM_P0_IO3 */
#define OSPIM_P0_IO3_PA1 \
	GD32_PINMUX_AF('A', 1, AF9)
#define OSPIM_P0_IO3_PA6 \
	GD32_PINMUX_AF('A', 6, AF6)
#define OSPIM_P0_IO3_PD13 \
	GD32_PINMUX_AF('D', 13, AF9)
#define OSPIM_P0_IO3_PF6 \
	GD32_PINMUX_AF('F', 6, AF10)

/* OSPIM_P0_IO4 */
#define OSPIM_P0_IO4_PC1 \
	GD32_PINMUX_AF('C', 1, AF10)
#define OSPIM_P0_IO4_PD4 \
	GD32_PINMUX_AF('D', 4, AF10)
#define OSPIM_P0_IO4_PE7 \
	GD32_PINMUX_AF('E', 7, AF10)
#define OSPIM_P0_IO4_PH2 \
	GD32_PINMUX_AF('H', 2, AF9)

/* OSPIM_P0_IO5 */
#define OSPIM_P0_IO5_PC2 \
	GD32_PINMUX_AF('C', 2, AF4)
#define OSPIM_P0_IO5_PD5 \
	GD32_PINMUX_AF('D', 5, AF10)
#define OSPIM_P0_IO5_PE8 \
	GD32_PINMUX_AF('E', 8, AF10)
#define OSPIM_P0_IO5_PH3 \
	GD32_PINMUX_AF('H', 3, AF9)

/* OSPIM_P0_IO6 */
#define OSPIM_P0_IO6_PA0 \
	GD32_PINMUX_AF('A', 0, AF6)
#define OSPIM_P0_IO6_PC3 \
	GD32_PINMUX_AF('C', 3, AF4)
#define OSPIM_P0_IO6_PD6 \
	GD32_PINMUX_AF('D', 6, AF10)
#define OSPIM_P0_IO6_PE9 \
	GD32_PINMUX_AF('E', 9, AF10)
#define OSPIM_P0_IO6_PG9 \
	GD32_PINMUX_AF('G', 9, AF9)

/* OSPIM_P0_IO7 */
#define OSPIM_P0_IO7_PD7 \
	GD32_PINMUX_AF('D', 7, AF10)
#define OSPIM_P0_IO7_PE10 \
	GD32_PINMUX_AF('E', 10, AF10)
#define OSPIM_P0_IO7_PG14 \
	GD32_PINMUX_AF('G', 14, AF9)

/* OSPIM_P0_SCK */
#define OSPIM_P0_SCK_PA3 \
	GD32_PINMUX_AF('A', 3, AF12)
#define OSPIM_P0_SCK_PB2 \
	GD32_PINMUX_AF('B', 2, AF9)
#define OSPIM_P0_SCK_PF10 \
	GD32_PINMUX_AF('F', 10, AF9)

/* PMU_DEEPSLEEP */
#define PMU_DEEPSLEEP_PC2 \
	GD32_PINMUX_AF('C', 2, AF0)
#define PMU_DEEPSLEEP_PC4 \
	GD32_PINMUX_AF('C', 4, AF0)

/* PMU_SLEEP */
#define PMU_SLEEP_PC3 \
	GD32_PINMUX_AF('C', 3, AF0)
#define PMU_SLEEP_PC5 \
	GD32_PINMUX_AF('C', 5, AF0)

/* PVD_IN */
#define PVD_IN_PB7 \
	GD32_PINMUX_AF('B', 7, ANALOG)

/* RTC_OUT */
#define RTC_OUT_PB2 \
	GD32_PINMUX_AF('B', 2, AF0)

/* RTC_REFIN */
#define RTC_REFIN_PB13 \
	GD32_PINMUX_AF('B', 13, AF0)
#define RTC_REFIN_PB15 \
	GD32_PINMUX_AF('B', 15, AF0)

/* SPI0_MISO */
#define SPI0_MISO_PA6 \
	GD32_PINMUX_AF('A', 6, AF5)
#define SPI0_MISO_PB4 \
	GD32_PINMUX_AF('B', 4, AF5)
#define SPI0_MISO_PG9 \
	GD32_PINMUX_AF('G', 9, AF5)

/* SPI0_MOSI */
#define SPI0_MOSI_PA7 \
	GD32_PINMUX_AF('A', 7, AF5)
#define SPI0_MOSI_PB5 \
	GD32_PINMUX_AF('B', 5, AF5)
#define SPI0_MOSI_PD7 \
	GD32_PINMUX_AF('D', 7, AF5)

/* SPI0_NSS */
#define SPI0_NSS_PA4 \
	GD32_PINMUX_AF('A', 4, AF5)
#define SPI0_NSS_PA15 \
	GD32_PINMUX_AF('A', 15, AF5)

/* SPI0_SCK */
#define SPI0_SCK_PA5 \
	GD32_PINMUX_AF('A', 5, AF5)
#define SPI0_SCK_PB3 \
	GD32_PINMUX_AF('B', 3, AF5)

/* SPI1_MISO */
#define SPI1_MISO_PB14 \
	GD32_PINMUX_AF('B', 14, AF5)
#define SPI1_MISO_PC2 \
	GD32_PINMUX_AF('C', 2, AF5)

/* SPI1_MOSI */
#define SPI1_MOSI_PB15 \
	GD32_PINMUX_AF('B', 15, AF5)
#define SPI1_MOSI_PC1 \
	GD32_PINMUX_AF('C', 1, AF5)
#define SPI1_MOSI_PC3 \
	GD32_PINMUX_AF('C', 3, AF5)

/* SPI1_NSS */
#define SPI1_NSS_PA11 \
	GD32_PINMUX_AF('A', 11, AF5)
#define SPI1_NSS_PA13 \
	GD32_PINMUX_AF('A', 13, AF5)
#define SPI1_NSS_PB4 \
	GD32_PINMUX_AF('B', 4, AF7)
#define SPI1_NSS_PB9 \
	GD32_PINMUX_AF('B', 9, AF5)
#define SPI1_NSS_PB12 \
	GD32_PINMUX_AF('B', 12, AF5)

/* SPI1_SCK */
#define SPI1_SCK_PA9 \
	GD32_PINMUX_AF('A', 9, AF5)
#define SPI1_SCK_PA12 \
	GD32_PINMUX_AF('A', 12, AF5)
#define SPI1_SCK_PA14 \
	GD32_PINMUX_AF('A', 14, AF5)
#define SPI1_SCK_PB10 \
	GD32_PINMUX_AF('B', 10, AF5)
#define SPI1_SCK_PB13 \
	GD32_PINMUX_AF('B', 13, AF5)
#define SPI1_SCK_PD3 \
	GD32_PINMUX_AF('D', 3, AF5)

/* SPI2_MISO */
#define SPI2_MISO_PB4 \
	GD32_PINMUX_AF('B', 4, AF6)
#define SPI2_MISO_PC11 \
	GD32_PINMUX_AF('C', 11, AF6)

/* SPI2_MOSI */
#define SPI2_MOSI_PB2 \
	GD32_PINMUX_AF('B', 2, AF7)
#define SPI2_MOSI_PB5 \
	GD32_PINMUX_AF('B', 5, AF7)
#define SPI2_MOSI_PC12 \
	GD32_PINMUX_AF('C', 12, AF6)
#define SPI2_MOSI_PD6 \
	GD32_PINMUX_AF('D', 6, AF5)

/* SPI2_NSS */
#define SPI2_NSS_PA4 \
	GD32_PINMUX_AF('A', 4, AF6)
#define SPI2_NSS_PA15 \
	GD32_PINMUX_AF('A', 15, AF6)

