GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32h75ey(m)xx-pinctrl.h
/* SPI2_SCK */
#define SPI2_SCK_PB3 \
	GD32_PINMUX_AF('B', 3, AF6)
#define SPI2_SCK_PC10 \
	GD32_PINMUX_AF('C', 10, AF6)

/* SPI3_IO2 */
#define SPI3_IO2_PD14 \
	GD32_PINMUX_AF('D', 14, AF5)
#define SPI3_IO2_PE9 \
	GD32_PINMUX_AF('E', 9, AF5)

/* SPI3_IO3 */
#define SPI3_IO3_PD15 \
	GD32_PINMUX_AF('D', 15, AF5)
#define SPI3_IO3_PE10 \
	GD32_PINMUX_AF('E', 10, AF5)

/* SPI3_MISO */
#define SPI3_MISO_PE5 \
	GD32_PINMUX_AF('E', 5, AF5)
#define SPI3_MISO_PE13 \
	GD32_PINMUX_AF('E', 13, AF5)

/* SPI3_MOSI */
#define SPI3_MOSI_PE6 \
	GD32_PINMUX_AF('E', 6, AF5)
#define SPI3_MOSI_PE14 \
	GD32_PINMUX_AF('E', 14, AF5)

/* SPI3_NSS */
#define SPI3_NSS_PE4 \
	GD32_PINMUX_AF('E', 4, AF5)
#define SPI3_NSS_PE11 \
	GD32_PINMUX_AF('E', 11, AF5)

/* SPI3_SCK */
#define SPI3_SCK_PE2 \
	GD32_PINMUX_AF('E', 2, AF5)
#define SPI3_SCK_PE12 \
	GD32_PINMUX_AF('E', 12, AF5)

/* SPI4_IO2 */
#define SPI4_IO2_PF14 \
	GD32_PINMUX_AF('F', 14, AF5)
#define SPI4_IO2_PH8 \
	GD32_PINMUX_AF('H', 8, AF5)

/* SPI4_IO3 */
#define SPI4_IO3_PF15 \
	GD32_PINMUX_AF('F', 15, AF5)
#define SPI4_IO3_PH9 \
	GD32_PINMUX_AF('H', 9, AF5)

/* SPI4_MISO */
#define SPI4_MISO_PF8 \
	GD32_PINMUX_AF('F', 8, AF5)
#define SPI4_MISO_PH7 \
	GD32_PINMUX_AF('H', 7, AF5)

/* SPI4_MOSI */
#define SPI4_MOSI_PF9 \
	GD32_PINMUX_AF('F', 9, AF5)
#define SPI4_MOSI_PF11 \
	GD32_PINMUX_AF('F', 11, AF5)

/* SPI4_NSS */
#define SPI4_NSS_PF6 \
	GD32_PINMUX_AF('F', 6, AF5)
#define SPI4_NSS_PH5 \
	GD32_PINMUX_AF('H', 5, AF5)

/* SPI4_SCK */
#define SPI4_SCK_PF7 \
	GD32_PINMUX_AF('F', 7, AF5)
#define SPI4_SCK_PH6 \
	GD32_PINMUX_AF('H', 6, AF5)

/* SPI5_MISO */
#define SPI5_MISO_PA6 \
	GD32_PINMUX_AF('A', 6, AF8)
#define SPI5_MISO_PB4 \
	GD32_PINMUX_AF('B', 4, AF8)

/* SPI5_MOSI */
#define SPI5_MOSI_PA7 \
	GD32_PINMUX_AF('A', 7, AF8)
#define SPI5_MOSI_PB5 \
	GD32_PINMUX_AF('B', 5, AF8)
#define SPI5_MOSI_PG14 \
	GD32_PINMUX_AF('G', 14, AF5)

/* SPI5_NSS */
#define SPI5_NSS_PA0 \
	GD32_PINMUX_AF('A', 0, AF5)
#define SPI5_NSS_PA4 \
	GD32_PINMUX_AF('A', 4, AF8)
#define SPI5_NSS_PA15 \
	GD32_PINMUX_AF('A', 15, AF7)
#define SPI5_NSS_PG8 \
	GD32_PINMUX_AF('G', 8, AF5)

/* SPI5_SCK */
#define SPI5_SCK_PA5 \
	GD32_PINMUX_AF('A', 5, AF8)
#define SPI5_SCK_PB3 \
	GD32_PINMUX_AF('B', 3, AF8)
#define SPI5_SCK_PC12 \
	GD32_PINMUX_AF('C', 12, AF5)
#define SPI5_SCK_PG13 \
	GD32_PINMUX_AF('G', 13, AF5)

/* SWCLK */
#define SWCLK_PA14 \
	GD32_PINMUX_AF('A', 14, AF0)

/* SWDIO */
#define SWDIO_PA13 \
	GD32_PINMUX_AF('A', 13, AF0)

/* TIMER0_BRKIN0 */
#define TIMER0_BRKIN0_PA6 \
	GD32_PINMUX_AF('A', 6, AF1)
#define TIMER0_BRKIN0_PB12 \
	GD32_PINMUX_AF('B', 12, AF1)
#define TIMER0_BRKIN0_PE15 \
	GD32_PINMUX_AF('E', 15, AF1)

/* TIMER0_BRKIN1 */
#define TIMER0_BRKIN1_PA13 \
	GD32_PINMUX_AF('A', 13, AF1)
#define TIMER0_BRKIN1_PC6 \
	GD32_PINMUX_AF('C', 6, AF1)
#define TIMER0_BRKIN1_PE4 \
	GD32_PINMUX_AF('E', 4, AF1)

/* TIMER0_BRKIN2 */
#define TIMER0_BRKIN2_PA12 \
	GD32_PINMUX_AF('A', 12, AF12)
#define TIMER0_BRKIN2_PA14 \
	GD32_PINMUX_AF('A', 14, AF12)
#define TIMER0_BRKIN2_PE6 \
	GD32_PINMUX_AF('E', 6, AF1)

/* TIMER0_CH0 */
#define TIMER0_CH0_PA8 \
	GD32_PINMUX_AF('A', 8, AF1)
#define TIMER0_CH0_PE9 \
	GD32_PINMUX_AF('E', 9, AF1)

/* TIMER0_CH1 */
#define TIMER0_CH1_PA9 \
	GD32_PINMUX_AF('A', 9, AF1)
#define TIMER0_CH1_PE11 \
	GD32_PINMUX_AF('E', 11, AF1)

/* TIMER0_CH2 */
#define TIMER0_CH2_PA10 \
	GD32_PINMUX_AF('A', 10, AF1)
#define TIMER0_CH2_PE13 \
	GD32_PINMUX_AF('E', 13, AF1)

/* TIMER0_CH3 */
#define TIMER0_CH3_PA11 \
	GD32_PINMUX_AF('A', 11, AF1)
#define TIMER0_CH3_PC7 \
	GD32_PINMUX_AF('C', 7, AF1)
#define TIMER0_CH3_PC10 \
	GD32_PINMUX_AF('C', 10, AF1)
#define TIMER0_CH3_PE14 \
	GD32_PINMUX_AF('E', 14, AF1)

/* TIMER0_ETI */
#define TIMER0_ETI_PA12 \
	GD32_PINMUX_AF('A', 12, AF1)
#define TIMER0_ETI_PC11 \
	GD32_PINMUX_AF('C', 11, AF1)
#define TIMER0_ETI_PE7 \
	GD32_PINMUX_AF('E', 7, AF1)

/* TIMER0_MCH0 */
#define TIMER0_MCH0_PA7 \
	GD32_PINMUX_AF('A', 7, AF1)
#define TIMER0_MCH0_PB13 \
	GD32_PINMUX_AF('B', 13, AF1)
#define TIMER0_MCH0_PE8 \
	GD32_PINMUX_AF('E', 8, AF1)

/* TIMER0_MCH1 */
#define TIMER0_MCH1_PB0 \
	GD32_PINMUX_AF('B', 0, AF1)
#define TIMER0_MCH1_PB14 \
	GD32_PINMUX_AF('B', 14, AF1)
#define TIMER0_MCH1_PE10 \
	GD32_PINMUX_AF('E', 10, AF1)

/* TIMER0_MCH2 */
#define TIMER0_MCH2_PB1 \
	GD32_PINMUX_AF('B', 1, AF1)
#define TIMER0_MCH2_PB15 \
	GD32_PINMUX_AF('B', 15, AF1)
#define TIMER0_MCH2_PE12 \
	GD32_PINMUX_AF('E', 12, AF1)
#define TIMER0_MCH2_PF5 \
	GD32_PINMUX_AF('F', 5, AF1)

/* TIMER0_MCH3 */
#define TIMER0_MCH3_PC9 \
	GD32_PINMUX_AF('C', 9, AF1)

/* TIMER14_BRKIN0 */
#define TIMER14_BRKIN0_PA0 \
	GD32_PINMUX_AF('A', 0, AF4)
#define TIMER14_BRKIN0_PD2 \
	GD32_PINMUX_AF('D', 2, AF4)
#define TIMER14_BRKIN0_PE3 \
	GD32_PINMUX_AF('E', 3, AF4)

/* TIMER14_CH0 */
#define TIMER14_CH0_PA2 \
	GD32_PINMUX_AF('A', 2, AF4)
#define TIMER14_CH0_PC12 \
	GD32_PINMUX_AF('C', 12, AF2)
#define TIMER14_CH0_PE5 \
	GD32_PINMUX_AF('E', 5, AF4)

/* TIMER14_CH1 */
#define TIMER14_CH1_PA3 \
	GD32_PINMUX_AF('A', 3, AF4)
#define TIMER14_CH1_PE6 \
	GD32_PINMUX_AF('E', 6, AF4)

/* TIMER14_MCH0 */
#define TIMER14_MCH0_PA1 \
	GD32_PINMUX_AF('A', 1, AF4)
#define TIMER14_MCH0_PE4 \
	GD32_PINMUX_AF('E', 4, AF4)

/* TIMER15_BRKIN0 */
#define TIMER15_BRKIN0_PB4 \
	GD32_PINMUX_AF('B', 4, AF1)
#define TIMER15_BRKIN0_PF10 \
	GD32_PINMUX_AF('F', 10, AF1)

/* TIMER15_CH0 */
#define TIMER15_CH0_PB8 \
	GD32_PINMUX_AF('B', 8, AF1)
#define TIMER15_CH0_PF6 \
	GD32_PINMUX_AF('F', 6, AF1)

/* TIMER15_MCH0 */
#define TIMER15_MCH0_PB6 \
	GD32_PINMUX_AF('B', 6, AF1)
#define TIMER15_MCH0_PF8 \
	GD32_PINMUX_AF('F', 8, AF1)

/* TIMER16_BRKIN0 */
#define TIMER16_BRKIN0_PB5 \
	GD32_PINMUX_AF('B', 5, AF1)
#define TIMER16_BRKIN0_PG6 \
	GD32_PINMUX_AF('G', 6, AF1)

/* TIMER16_CH0 */
#define TIMER16_CH0_PB9 \
	GD32_PINMUX_AF('B', 9, AF1)
#define TIMER16_CH0_PF7 \
	GD32_PINMUX_AF('F', 7, AF1)

/* TIMER16_MCH0 */
#define TIMER16_MCH0_PB7 \
	GD32_PINMUX_AF('B', 7, AF1)
#define TIMER16_MCH0_PF9 \
	GD32_PINMUX_AF('F', 9, AF1)

/* TIMER1_CH0 */
#define TIMER1_CH0_PA0 \
	GD32_PINMUX_AF('A', 0, AF1)
#define TIMER1_CH0_PA5 \
	GD32_PINMUX_AF('A', 5, AF1)
#define TIMER1_CH0_PA15 \
	GD32_PINMUX_AF('A', 15, AF1)

/* TIMER1_CH1 */
#define TIMER1_CH1_PA1 \
	GD32_PINMUX_AF('A', 1, AF1)
#define TIMER1_CH1_PB3 \
	GD32_PINMUX_AF('B', 3, AF1)

