GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32h75ey(m)xx-pinctrl.h
/* TIMER1_CH2 */
#define TIMER1_CH2_PA2 \
	GD32_PINMUX_AF('A', 2, AF1)
#define TIMER1_CH2_PB10 \
	GD32_PINMUX_AF('B', 10, AF1)

/* TIMER1_CH3 */
#define TIMER1_CH3_PA3 \
	GD32_PINMUX_AF('A', 3, AF1)
#define TIMER1_CH3_PB11 \
	GD32_PINMUX_AF('B', 11, AF1)

/* TIMER1_ETI */
#define TIMER1_ETI_PA0 \
	GD32_PINMUX_AF('A', 0, AF1)
#define TIMER1_ETI_PA5 \
	GD32_PINMUX_AF('A', 5, AF1)
#define TIMER1_ETI_PA15 \
	GD32_PINMUX_AF('A', 15, AF1)

/* TIMER22_CH0 */
#define TIMER22_CH0_PF6 \
	GD32_PINMUX_AF('F', 6, AF13)

/* TIMER22_CH1 */
#define TIMER22_CH1_PF7 \
	GD32_PINMUX_AF('F', 7, AF13)
#define TIMER22_CH1_PG13 \
	GD32_PINMUX_AF('G', 13, AF13)

/* TIMER22_CH2 */
#define TIMER22_CH2_PF8 \
	GD32_PINMUX_AF('F', 8, AF13)
#define TIMER22_CH2_PG14 \
	GD32_PINMUX_AF('G', 14, AF13)

/* TIMER22_CH3 */
#define TIMER22_CH3_PF9 \
	GD32_PINMUX_AF('F', 9, AF13)

/* TIMER22_ETI */
#define TIMER22_ETI_PB2 \
	GD32_PINMUX_AF('B', 2, AF13)

/* TIMER23_CH0 */
#define TIMER23_CH0_PF11 \
	GD32_PINMUX_AF('F', 11, AF14)

/* TIMER23_CH1 */
#define TIMER23_CH1_PF12 \
	GD32_PINMUX_AF('F', 12, AF14)

/* TIMER23_CH2 */
#define TIMER23_CH2_PF13 \
	GD32_PINMUX_AF('F', 13, AF14)

/* TIMER23_CH3 */
#define TIMER23_CH3_PF14 \
	GD32_PINMUX_AF('F', 14, AF14)

/* TIMER23_ETI */
#define TIMER23_ETI_PB3 \
	GD32_PINMUX_AF('B', 3, AF14)

/* TIMER2_CH0 */
#define TIMER2_CH0_PA6 \
	GD32_PINMUX_AF('A', 6, AF2)
#define TIMER2_CH0_PB4 \
	GD32_PINMUX_AF('B', 4, AF2)
#define TIMER2_CH0_PC6 \
	GD32_PINMUX_AF('C', 6, AF2)

/* TIMER2_CH1 */
#define TIMER2_CH1_PA7 \
	GD32_PINMUX_AF('A', 7, AF2)
#define TIMER2_CH1_PB5 \
	GD32_PINMUX_AF('B', 5, AF2)
#define TIMER2_CH1_PC7 \
	GD32_PINMUX_AF('C', 7, AF2)

/* TIMER2_CH2 */
#define TIMER2_CH2_PB0 \
	GD32_PINMUX_AF('B', 0, AF2)
#define TIMER2_CH2_PC8 \
	GD32_PINMUX_AF('C', 8, AF2)

/* TIMER2_CH3 */
#define TIMER2_CH3_PB1 \
	GD32_PINMUX_AF('B', 1, AF2)
#define TIMER2_CH3_PC9 \
	GD32_PINMUX_AF('C', 9, AF2)

/* TIMER2_ETI */
#define TIMER2_ETI_PD2 \
	GD32_PINMUX_AF('D', 2, AF2)

/* TIMER3_CH0 */
#define TIMER3_CH0_PB6 \
	GD32_PINMUX_AF('B', 6, AF2)
#define TIMER3_CH0_PD12 \
	GD32_PINMUX_AF('D', 12, AF2)

/* TIMER3_CH1 */
#define TIMER3_CH1_PB7 \
	GD32_PINMUX_AF('B', 7, AF2)
#define TIMER3_CH1_PD13 \
	GD32_PINMUX_AF('D', 13, AF2)

/* TIMER3_CH2 */
#define TIMER3_CH2_PB8 \
	GD32_PINMUX_AF('B', 8, AF2)
#define TIMER3_CH2_PD14 \
	GD32_PINMUX_AF('D', 14, AF2)

/* TIMER3_CH3 */
#define TIMER3_CH3_PB9 \
	GD32_PINMUX_AF('B', 9, AF2)
#define TIMER3_CH3_PD15 \
	GD32_PINMUX_AF('D', 15, AF2)

/* TIMER3_ETI */
#define TIMER3_ETI_PE0 \
	GD32_PINMUX_AF('E', 0, AF2)

/* TIMER40_BRKIN0 */
#define TIMER40_BRKIN0_PH4 \
	GD32_PINMUX_AF('H', 4, AF7)

/* TIMER40_CH0 */
#define TIMER40_CH0_PC0 \
	GD32_PINMUX_AF('C', 0, AF7)
#define TIMER40_CH0_PH2 \
	GD32_PINMUX_AF('H', 2, AF7)

/* TIMER40_CH1 */
#define TIMER40_CH1_PD11 \
	GD32_PINMUX_AF('D', 11, AF0)

/* TIMER40_MCH0 */
#define TIMER40_MCH0_PC1 \
	GD32_PINMUX_AF('C', 1, AF7)
#define TIMER40_MCH0_PH3 \
	GD32_PINMUX_AF('H', 3, AF7)

/* TIMER41_BRKIN0 */
#define TIMER41_BRKIN0_PH7 \
	GD32_PINMUX_AF('H', 7, AF7)

/* TIMER41_CH0 */
#define TIMER41_CH0_PC4 \
	GD32_PINMUX_AF('C', 4, AF7)
#define TIMER41_CH0_PH5 \
	GD32_PINMUX_AF('H', 5, AF7)

/* TIMER41_CH1 */
#define TIMER41_CH1_PD12 \
	GD32_PINMUX_AF('D', 12, AF0)

/* TIMER41_MCH0 */
#define TIMER41_MCH0_PC5 \
	GD32_PINMUX_AF('C', 5, AF7)
#define TIMER41_MCH0_PH6 \
	GD32_PINMUX_AF('H', 6, AF7)

/* TIMER42_BRKIN0 */
#define TIMER42_BRKIN0_PH10 \
	GD32_PINMUX_AF('H', 10, AF7)

/* TIMER42_CH0 */
#define TIMER42_CH0_PH8 \
	GD32_PINMUX_AF('H', 8, AF7)

/* TIMER42_CH1 */
#define TIMER42_CH1_PD13 \
	GD32_PINMUX_AF('D', 13, AF0)

/* TIMER42_MCH0 */
#define TIMER42_MCH0_PH9 \
	GD32_PINMUX_AF('H', 9, AF7)

/* TIMER43_BRKIN0 */
#define TIMER43_BRKIN0_PH13 \
	GD32_PINMUX_AF('H', 13, AF7)

/* TIMER43_CH0 */
#define TIMER43_CH0_PH11 \
	GD32_PINMUX_AF('H', 11, AF7)

/* TIMER43_CH1 */
#define TIMER43_CH1_PD14 \
	GD32_PINMUX_AF('D', 14, AF0)

/* TIMER43_MCH0 */
#define TIMER43_MCH0_PH12 \
	GD32_PINMUX_AF('H', 12, AF7)

/* TIMER44_BRKIN0 */
#define TIMER44_BRKIN0_PG15 \
	GD32_PINMUX_AF('G', 15, AF8)

/* TIMER44_CH0 */
#define TIMER44_CH0_PG13 \
	GD32_PINMUX_AF('G', 13, AF8)

/* TIMER44_CH1 */
#define TIMER44_CH1_PD15 \
	GD32_PINMUX_AF('D', 15, AF0)

/* TIMER44_MCH0 */
#define TIMER44_MCH0_PG14 \
	GD32_PINMUX_AF('G', 14, AF8)

/* TIMER4_CH0 */
#define TIMER4_CH0_PA0 \
	GD32_PINMUX_AF('A', 0, AF2)
#define TIMER4_CH0_PH10 \
	GD32_PINMUX_AF('H', 10, AF2)

/* TIMER4_CH1 */
#define TIMER4_CH1_PA1 \
	GD32_PINMUX_AF('A', 1, AF2)
#define TIMER4_CH1_PH11 \
	GD32_PINMUX_AF('H', 11, AF2)

/* TIMER4_CH2 */
#define TIMER4_CH2_PA2 \
	GD32_PINMUX_AF('A', 2, AF2)
#define TIMER4_CH2_PH12 \
	GD32_PINMUX_AF('H', 12, AF2)

/* TIMER4_CH3 */
#define TIMER4_CH3_PA3 \
	GD32_PINMUX_AF('A', 3, AF2)

/* TIMER4_ETI */
#define TIMER4_ETI_PA4 \
	GD32_PINMUX_AF('A', 4, AF2)
#define TIMER4_ETI_PH8 \
	GD32_PINMUX_AF('H', 8, AF2)

/* TIMER7_BRKIN0 */
#define TIMER7_BRKIN0_PA6 \
	GD32_PINMUX_AF('A', 6, AF3)

/* TIMER7_BRKIN1 */
#define TIMER7_BRKIN1_PA13 \
	GD32_PINMUX_AF('A', 13, AF3)
#define TIMER7_BRKIN1_PG9 \
	GD32_PINMUX_AF('G', 9, AF3)

/* TIMER7_BRKIN2 */
#define TIMER7_BRKIN2_PA8 \
	GD32_PINMUX_AF('A', 8, AF3)

/* TIMER7_CH0 */
#define TIMER7_CH0_PC6 \
	GD32_PINMUX_AF('C', 6, AF3)

/* TIMER7_CH1 */
#define TIMER7_CH1_PC7 \
	GD32_PINMUX_AF('C', 7, AF3)

/* TIMER7_CH2 */
#define TIMER7_CH2_PC8 \
	GD32_PINMUX_AF('C', 8, AF3)
#define TIMER7_CH2_PD0 \
	GD32_PINMUX_AF('D', 0, AF2)

/* TIMER7_CH3 */
#define TIMER7_CH3_PC9 \
	GD32_PINMUX_AF('C', 9, AF3)
#define TIMER7_CH3_PD5 \
	GD32_PINMUX_AF('D', 5, AF3)

/* TIMER7_ETI */
#define TIMER7_ETI_PA0 \
	GD32_PINMUX_AF('A', 0, AF3)
#define TIMER7_ETI_PG8 \
	GD32_PINMUX_AF('G', 8, AF3)

/* TIMER7_MCH0 */
#define TIMER7_MCH0_PA5 \
	GD32_PINMUX_AF('A', 5, AF3)
#define TIMER7_MCH0_PA7 \
	GD32_PINMUX_AF('A', 7, AF3)
#define TIMER7_MCH0_PH13 \
	GD32_PINMUX_AF('H', 13, AF3)

/* TIMER7_MCH1 */
#define TIMER7_MCH1_PB0 \
	GD32_PINMUX_AF('B', 0, AF3)
#define TIMER7_MCH1_PB14 \
	GD32_PINMUX_AF('B', 14, AF3)

/* TIMER7_MCH2 */
#define TIMER7_MCH2_PB1 \
	GD32_PINMUX_AF('B', 1, AF3)
#define TIMER7_MCH2_PB15 \
	GD32_PINMUX_AF('B', 15, AF3)
#define TIMER7_MCH2_PF5 \
	GD32_PINMUX_AF('F', 5, AF3)

/* TIMER7_MCH3 */
#define TIMER7_MCH3_PD4 \
	GD32_PINMUX_AF('D', 4, AF3)
#define TIMER7_MCH3_PD11 \
	GD32_PINMUX_AF('D', 11, AF3)

/* TRACECK */
#define TRACECK_PE2 \
	GD32_PINMUX_AF('E', 2, AF0)

/* TRACED0 */
#define TRACED0_PC1 \
	GD32_PINMUX_AF('C', 1, AF0)
#define TRACED0_PE3 \
	GD32_PINMUX_AF('E', 3, AF0)
#define TRACED0_PG13 \
	GD32_PINMUX_AF('G', 13, AF0)

/* TRACED1 */
#define TRACED1_PC8 \
	GD32_PINMUX_AF('C', 8, AF0)
#define TRACED1_PE4 \
	GD32_PINMUX_AF('E', 4, AF0)
#define TRACED1_PG14 \
	GD32_PINMUX_AF('G', 14, AF0)

