GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32h75ey(m)xx-pinctrl.h
/* TRACED2 */
#define TRACED2_PD2 \
	GD32_PINMUX_AF('D', 2, AF0)
#define TRACED2_PE5 \
	GD32_PINMUX_AF('E', 5, AF0)

/* TRACED3 */
#define TRACED3_PC12 \
	GD32_PINMUX_AF('C', 12, AF0)
#define TRACED3_PE6 \
	GD32_PINMUX_AF('E', 6, AF0)

/* TRACESWO */
#define TRACESWO_PB3 \
	GD32_PINMUX_AF('B', 3, AF0)

/* TRIGSEL_IN0 */
#define TRIGSEL_IN0_PA0 \
	GD32_PINMUX_AF('A', 0, AF13)

/* TRIGSEL_IN1 */
#define TRIGSEL_IN1_PA1 \
	GD32_PINMUX_AF('A', 1, AF13)

/* TRIGSEL_IN10 */
#define TRIGSEL_IN10_PA13 \
	GD32_PINMUX_AF('A', 13, AF13)

/* TRIGSEL_IN11 */
#define TRIGSEL_IN11_PA14 \
	GD32_PINMUX_AF('A', 14, AF13)

/* TRIGSEL_IN12 */
#define TRIGSEL_IN12_PA10 \
	GD32_PINMUX_AF('A', 10, AF9)
#define TRIGSEL_IN12_PA12 \
	GD32_PINMUX_AF('A', 12, AF13)

/* TRIGSEL_IN13 */
#define TRIGSEL_IN13_PA9 \
	GD32_PINMUX_AF('A', 9, AF9)
#define TRIGSEL_IN13_PA11 \
	GD32_PINMUX_AF('A', 11, AF13)

/* TRIGSEL_IN2 */
#define TRIGSEL_IN2_PC2 \
	GD32_PINMUX_AF('C', 2, AF13)

/* TRIGSEL_IN3 */
#define TRIGSEL_IN3_PD0 \
	GD32_PINMUX_AF('D', 0, AF13)

/* TRIGSEL_IN4 */
#define TRIGSEL_IN4_PA3 \
	GD32_PINMUX_AF('A', 3, AF13)

/* TRIGSEL_IN5 */
#define TRIGSEL_IN5_PA7 \
	GD32_PINMUX_AF('A', 7, AF13)

/* TRIGSEL_IN6 */
#define TRIGSEL_IN6_PD1 \
	GD32_PINMUX_AF('D', 1, AF13)

/* TRIGSEL_IN7 */
#define TRIGSEL_IN7_PA2 \
	GD32_PINMUX_AF('A', 2, AF13)

/* TRIGSEL_IN8 */
#define TRIGSEL_IN8_PC0 \
	GD32_PINMUX_AF('C', 0, AF13)

/* TRIGSEL_IN9 */
#define TRIGSEL_IN9_PC1 \
	GD32_PINMUX_AF('C', 1, AF13)

/* TRIGSEL_OUT0 */
#define TRIGSEL_OUT0_PA15 \
	GD32_PINMUX_AF('A', 15, AF13)

/* TRIGSEL_OUT1 */
#define TRIGSEL_OUT1_PB14 \
	GD32_PINMUX_AF('B', 14, AF13)

/* TRIGSEL_OUT2 */
#define TRIGSEL_OUT2_PB10 \
	GD32_PINMUX_AF('B', 10, AF13)

/* TRIGSEL_OUT3 */
#define TRIGSEL_OUT3_PB0 \
	GD32_PINMUX_AF('B', 0, AF13)

/* TRIGSEL_OUT4 */
#define TRIGSEL_OUT4_PB1 \
	GD32_PINMUX_AF('B', 1, AF13)

/* TRIGSEL_OUT5 */
#define TRIGSEL_OUT5_PB15 \
	GD32_PINMUX_AF('B', 15, AF13)
#define TRIGSEL_OUT5_PF5 \
	GD32_PINMUX_AF('F', 5, AF13)

/* TRIGSEL_OUT6 */
#define TRIGSEL_OUT6_PB4 \
	GD32_PINMUX_AF('B', 4, AF13)

/* TRIGSEL_OUT7 */
#define TRIGSEL_OUT7_PB3 \
	GD32_PINMUX_AF('B', 3, AF13)

/* UART3_CTS */
#define UART3_CTS_PB0 \
	GD32_PINMUX_AF('B', 0, AF8)
#define UART3_CTS_PB15 \
	GD32_PINMUX_AF('B', 15, AF8)
#define UART3_CTS_PF5 \
	GD32_PINMUX_AF('F', 5, AF8)

/* UART3_DE */
#define UART3_DE_PA15 \
	GD32_PINMUX_AF('A', 15, AF8)
#define UART3_DE_PB14 \
	GD32_PINMUX_AF('B', 14, AF8)

/* UART3_RTS */
#define UART3_RTS_PA15 \
	GD32_PINMUX_AF('A', 15, AF8)
#define UART3_RTS_PB14 \
	GD32_PINMUX_AF('B', 14, AF8)

/* UART3_RX */
#define UART3_RX_PA1 \
	GD32_PINMUX_AF('A', 1, AF8)
#define UART3_RX_PA11 \
	GD32_PINMUX_AF('A', 11, AF8)
#define UART3_RX_PA13 \
	GD32_PINMUX_AF('A', 13, AF6)
#define UART3_RX_PB8 \
	GD32_PINMUX_AF('B', 8, AF8)
#define UART3_RX_PC11 \
	GD32_PINMUX_AF('C', 11, AF8)
#define UART3_RX_PD0 \
	GD32_PINMUX_AF('D', 0, AF8)

/* UART3_TX */
#define UART3_TX_PA0 \
	GD32_PINMUX_AF('A', 0, AF8)
#define UART3_TX_PA12 \
	GD32_PINMUX_AF('A', 12, AF8)
#define UART3_TX_PA14 \
	GD32_PINMUX_AF('A', 14, AF6)
#define UART3_TX_PB9 \
	GD32_PINMUX_AF('B', 9, AF8)
#define UART3_TX_PC10 \
	GD32_PINMUX_AF('C', 10, AF8)
#define UART3_TX_PD1 \
	GD32_PINMUX_AF('D', 1, AF8)
#define UART3_TX_PH13 \
	GD32_PINMUX_AF('H', 13, AF8)

/* UART4_CTS */
#define UART4_CTS_PC9 \
	GD32_PINMUX_AF('C', 9, AF8)

/* UART4_DE */
#define UART4_DE_PC8 \
	GD32_PINMUX_AF('C', 8, AF8)

/* UART4_RTS */
#define UART4_RTS_PC8 \
	GD32_PINMUX_AF('C', 8, AF8)

/* UART4_RX */
#define UART4_RX_PB5 \
	GD32_PINMUX_AF('B', 5, AF14)
#define UART4_RX_PB12 \
	GD32_PINMUX_AF('B', 12, AF14)
#define UART4_RX_PD2 \
	GD32_PINMUX_AF('D', 2, AF8)

/* UART4_TX */
#define UART4_TX_PB6 \
	GD32_PINMUX_AF('B', 6, AF14)
#define UART4_TX_PB13 \
	GD32_PINMUX_AF('B', 13, AF14)
#define UART4_TX_PC12 \
	GD32_PINMUX_AF('C', 12, AF8)

/* UART6_CTS */
#define UART6_CTS_PE10 \
	GD32_PINMUX_AF('E', 10, AF7)
#define UART6_CTS_PF9 \
	GD32_PINMUX_AF('F', 9, AF7)

/* UART6_DE */
#define UART6_DE_PE9 \
	GD32_PINMUX_AF('E', 9, AF7)
#define UART6_DE_PF8 \
	GD32_PINMUX_AF('F', 8, AF7)

/* UART6_RTS */
#define UART6_RTS_PE9 \
	GD32_PINMUX_AF('E', 9, AF7)
#define UART6_RTS_PF8 \
	GD32_PINMUX_AF('F', 8, AF7)

/* UART6_RX */
#define UART6_RX_PA8 \
	GD32_PINMUX_AF('A', 8, AF11)
#define UART6_RX_PB3 \
	GD32_PINMUX_AF('B', 3, AF11)
#define UART6_RX_PE7 \
	GD32_PINMUX_AF('E', 7, AF7)
#define UART6_RX_PF6 \
	GD32_PINMUX_AF('F', 6, AF7)

/* UART6_TX */
#define UART6_TX_PA15 \
	GD32_PINMUX_AF('A', 15, AF11)
#define UART6_TX_PB4 \
	GD32_PINMUX_AF('B', 4, AF11)
#define UART6_TX_PE8 \
	GD32_PINMUX_AF('E', 8, AF7)
#define UART6_TX_PF7 \
	GD32_PINMUX_AF('F', 7, AF7)

/* UART7_CTS */
#define UART7_CTS_PD14 \
	GD32_PINMUX_AF('D', 14, AF8)

/* UART7_DE */
#define UART7_DE_PD15 \
	GD32_PINMUX_AF('D', 15, AF8)

/* UART7_RTS */
#define UART7_RTS_PD15 \
	GD32_PINMUX_AF('D', 15, AF8)

/* UART7_RX */
#define UART7_RX_PE0 \
	GD32_PINMUX_AF('E', 0, AF8)

/* UART7_TX */
#define UART7_TX_PE1 \
	GD32_PINMUX_AF('E', 1, AF8)

/* USART0_CK */
#define USART0_CK_PA8 \
	GD32_PINMUX_AF('A', 8, AF7)

/* USART0_CTS */
#define USART0_CTS_PA11 \
	GD32_PINMUX_AF('A', 11, AF7)
#define USART0_CTS_PA13 \
	GD32_PINMUX_AF('A', 13, AF7)

/* USART0_DE */
#define USART0_DE_PA12 \
	GD32_PINMUX_AF('A', 12, AF7)
#define USART0_DE_PA14 \
	GD32_PINMUX_AF('A', 14, AF7)

/* USART0_RTS */
#define USART0_RTS_PA12 \
	GD32_PINMUX_AF('A', 12, AF7)
#define USART0_RTS_PA14 \
	GD32_PINMUX_AF('A', 14, AF7)

/* USART0_RX */
#define USART0_RX_PA10 \
	GD32_PINMUX_AF('A', 10, AF7)
#define USART0_RX_PB7 \
	GD32_PINMUX_AF('B', 7, AF7)
#define USART0_RX_PB15 \
	GD32_PINMUX_AF('B', 15, AF4)
#define USART0_RX_PF5 \
	GD32_PINMUX_AF('F', 5, AF4)

/* USART0_TX */
#define USART0_TX_PA9 \
	GD32_PINMUX_AF('A', 9, AF7)
#define USART0_TX_PB6 \
	GD32_PINMUX_AF('B', 6, AF7)
#define USART0_TX_PB14 \
	GD32_PINMUX_AF('B', 14, AF4)

/* USART1_CK */
#define USART1_CK_PA4 \
	GD32_PINMUX_AF('A', 4, AF7)
#define USART1_CK_PD7 \
	GD32_PINMUX_AF('D', 7, AF7)

/* USART1_CTS */
#define USART1_CTS_PA0 \
	GD32_PINMUX_AF('A', 0, AF7)
#define USART1_CTS_PD3 \
	GD32_PINMUX_AF('D', 3, AF7)

/* USART1_DE */
#define USART1_DE_PA1 \
	GD32_PINMUX_AF('A', 1, AF7)
#define USART1_DE_PD4 \
	GD32_PINMUX_AF('D', 4, AF7)

/* USART1_RTS */
#define USART1_RTS_PA1 \
	GD32_PINMUX_AF('A', 1, AF7)
#define USART1_RTS_PD4 \
	GD32_PINMUX_AF('D', 4, AF7)

/* USART1_RX */
#define USART1_RX_PA3 \
	GD32_PINMUX_AF('A', 3, AF7)
#define USART1_RX_PD6 \
	GD32_PINMUX_AF('D', 6, AF7)

/* USART1_TX */
#define USART1_TX_PA2 \
	GD32_PINMUX_AF('A', 2, AF7)
#define USART1_TX_PD5 \
	GD32_PINMUX_AF('D', 5, AF7)

